# GetAlignments Method (Document) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Alignment..::..GetAlignments Method (Document)
Alignment Class See Also
---
Returns all alignments in the given document.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public static ICollection<Alignment> GetAlignments(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function GetAlignments ( _
	document As Document _
) As ICollection(Of Alignment)
```

Visual C++
---
```text
public:
static ICollection<Alignment^>^ GetAlignments(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..DocumentThe document for which the alignments are returned.
# See Also
Alignment Class
GetAlignments Overload
Autodesk.Revit.DB.Infrastructure Namespace